/*
 *     class:CameraAttention.cs
 * copyright:戸軽隆二
 *
 * 概要
 * 魔法を構える際に少し寄りめになる制御をするクラス
*/
using UnityEngine;
using System.Collections;

public class CameraAttention : MonoBehaviour
{
    //===============================================================================
    // コンストラクタ
    //===============================================================================
    public CameraAttention()
    {
        
    }
    //===============================================================================
    // 毎フレーム更新
    //===============================================================================
    public void Update()
    {

    }
}
