/*
 *     class:CameraMove.cs
 * copyright:戸軽隆二
 *
 * 概要
 * 視点移動を制御するクラス
*/
using UnityEngine;
using System.Collections;

public class CameraMove : MonoBehaviour
{
    //===============================================================================
    // コンストラクタ
    //===============================================================================
    public CameraMove(){
        
    }
    //===============================================================================
    // 毎フレーム更新
    //===============================================================================
    void Update()
    {

    }   
}
