//================================================================================================================
// AnimatorFinish.cs
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		アニメーション終了後にゲームオブジェクトを削除するクラス
		現在再生中のアニメーションクリップの再生時間に応じて削除する
*/
//================================================================================================================
/* バージョン
		戸軽隆二		1.0 クラス生成
*/
//================================================================================================================
using UnityEngine;
using System.Collections;

public class AnimationFinish : MonoBehaviour {

	// 削除したいオブジェクト
	// 基本は親オブジェク等を入れる
	public GameObject desObj;

	//================================================================================================
	// 常に実行し続ける処理
	//================================================================================================
	void Start() {
		// nullだったら自オブジェクトを入れておく
		if (desObj == null) desObj = gameObject;
		// 現在再生中のアニメーションクリップの再生時間を取得する
		Animator anim = GetComponent<Animator>();
		AnimatorStateInfo stateInfo = anim.GetCurrentAnimatorStateInfo(0);
		// 値がnullならとりあえず自分を消す
		if (desObj == null) desObj = gameObject;
		// 再生時間後に削除する
		Destroy(desObj, stateInfo.length);
	}
}
