//================================================================================================================
// EfectFinish.cs
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		エフェクトの消滅を管理をしているクラス
		予めエフェクトにこのスクリプトをアタッチ（もしくはAddComponent）しておけば
		アニメーション終了後に削除する
*/
//================================================================================================================
// バージョン
//		2017/06/26 戸軽隆二			1.0 クラス生成                               
//================================================================================================================
using UnityEngine;

public class EfectFinish : MonoBehaviour {

	private float mLength;
	private float mCur;

	void Start() {
		ParticleSystem particleSystem = GetComponent<ParticleSystem>();
		Destroy(this.gameObject, particleSystem.duration);
	}
}