//================================================================================================================
// TextrueSerch.cs
// 製作者：戸軽隆二
//================================================================================================================
/* 概要
		Resourcesフォルダ内の画像を取得する処理をまとめてあるクラス
		変数をstaticで保持するので何回もResourcesフォルダ内にアクセスはしない
*/
//================================================================================================================
// バージョン
//		戸軽隆二			1.0 クラス生成                                
//================================================================================================================
using UnityEngine;
using System.Collections;

public class TextureSerch : MonoBehaviour {

	// 取得した画像データの配列
	static Texture2D[] TEXTURE2D = new Texture2D[0];
	//========================================================================================================================================
	/// <summary>
	/// Resourcesフォルダ内のImageから画像を取得する関数
	/// </summary>
	/// <param name="name">画像の名前</param>
	/// <returns></returns>
	//========================================================================================================================================
	public Texture GetTexutre(string name) {
		// テクスチャー情報を取得したことが無かったら初期化
		if (TEXTURE2D.Length <= 0) Initialize();
		// 名前を検索し一致すれば返す
		foreach (Texture tex in TEXTURE2D) {
			if (tex.name == name) {
				return tex;
			}
		}

		// エラー処理
		Debug.Log("エラー。テクスチャーが取得できないです。");
		return null;
	}
	//========================================================================================================================================
	/// <summary>
	///  Resourcesフォルダ内のImageからSprite画像を取得する関数
	/// </summary>
	/// <param name="name">画像の名前</param>
	/// <returns></returns>
	//========================================================================================================================================
	public Sprite GetSprite(string name) {
		// テクスチャー情報を取得したことが無かったら初期化
		if (TEXTURE2D.Length <= 0) Initialize();
		// 名前を検索し一致すれば返す
		foreach (Texture2D tex in TEXTURE2D) {
			if (tex.name == name) {
				Sprite sp = Sprite.Create(tex, new Rect(0,0,tex.width, tex.height), new Vector2(0.5f,0.5f));
				return sp;
			}
		}

		// エラー処理
		Debug.Log("エラー。スプライトが取得できない。");
		return null;
	}
	//========================================================================================================================================
	// 初期化　テクスチャー情報を取得し配列に格納
	//========================================================================================================================================
	void Initialize() {
		TEXTURE2D = Resources.LoadAll<Texture2D>("Image");
	}
}
