/*
 *     class:PlayerAnimarionState.cs
 * copyright:戸軽隆二
 *
 * 概要
 * キャラクターのアニメーション管理用クラス
 * 下半身
 * ・通常ー前後左右に走る
 * ・しゃがみー前後左右に歩く
 * ・魔法詠唱中ー前後左右に歩く
 * 上半身
 * ・走る時の腕の振り方
 * ・
*/
using UnityEngine;
using System.Collections;

public class PlayerAnimarionState : MonoBehaviour
{


    //===============================================================================
    // コンストラクタ
    //===============================================================================
    public PlayerAnimarionState()
    {

    }
    //===============================================================================
    // 毎フレーム更新
    //===============================================================================
    public void Update()
    {

    }
}
